9/data/attachments/5fb7d289b609b4f0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_60a94ffb-b0d2-4575-90f7-06309ce18dc4</nif:username>
            <nif:friendToBeAdded>James_board_Friend_15466_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>